[
  {
    "id": "1tE4nK",
    "category": "Textile",
    "name": "Pom Pom cushion 45x45 cm",
    "sku": "sku_313355",
    "price": 76,
    "image": "https://www.nordicnest.com/4ae68c/globalassets/product-pictures/by-on/40697-01-02.jpg?quality=80&format=webp&width=740",
    "description": "The Pom Pom cushion 45x45 cm from the Swedish By On is a pure dream for those who love soft and cosy styles of decor. This wonderful cushion.",
    "description_long": "The Pom Pom cushion 45x45 cm from the Swedish By On is a pure dream for those who love soft and cosy styles of decor. This wonderful cushion is covered in small, fluffy Pom Poms, which quickly helps you create an inviting and snug feel on your corner sofa, your favourite recliner, or on the bed in the bedroom.",
    "currency": "USD",
    "countInStock": 3    
  },
  {
    "id": "IuFGYl",
    "category": "Tableware",
    "name": "Rustic mug",
    "sku": "sku_313356",
    "price": 6,
    "image": "https://www.nordicnest.com/490535/globalassets/product-pictures/house-doctor/23723-01-02.jpg?quality=80&format=webp&width=740",
    "description": "The beautiful Rustic mug from House Doctor is made of ceramics and has an appealing glaze in grey and blue that contributes to a rustic.",
    "description_long": "The beautiful Rustic mug from House Doctor is made of ceramics and has an appealing glaze in grey and blue that contributes to a rustic feeling. Since it's handmade, every mug is unique. Match it with other tableware in the Rustic series.",
    "currency": "USD",
    "countInStock": 6 
  },
  {
    "id": "VfcByl",
    "category": "Home Accessories",
    "name": "Triplets easter rabbit 3-pack",
    "sku": "sku_622147",
    "price": 16,
    "image": "https://www.nordicnest.com/4af2b7/globalassets/product-pictures/dbkd/42551-01-03.jpg?quality=80&format=webp&width=740",
    "description": "Cas plays modern with rustic wood, framing the rich color and defined grain of natural oak veneer in dark grey high-gloss lacquer.",
    "description_long": "Cas plays modern with rustic wood, framing the rich color and defined grain of natural oak veneer in dark grey high-gloss lacquer. Tinted warm brown with hints of grey, planks of veneer arrange the nightstand's four drawers in seamless asymmetry.",
    "currency": "USD",
    "countInStock": 4 
  },
  {
    "id": "1yF2Ib",
    "category": "Lighting",
    "name": "Silvia lamp white",
    "sku": "sku_125983",
    "price": 47,
    "image": "https://www.nordicnest.com/4ae4ed/globalassets/product-pictures/vita/p_22134-01-02.jpg?quality=80&format=webp&width=740",
    "description": "Renew your home with the trendy Silvia lamp in white designed by the Danish brand Umage / Vita. Silvia is a lampshade made of polypropylene.",
    "description_long": "Renew your home with the trendy Silvia lamp in white designed by the Danish brand Umage / Vita. Silvia is a lampshade made of polypropylene and plastic that comes unassembled with easy mounting instructions. The lampshade can be used both as pendant or table lamp depending how you mount it. Place the lamp in the living room or bedroom and let it spread a nice light! Choose between different sizes.",
    "currency": "USD",
    "countInStock": 5
  },
  {
    "id": "x5m8g3",
    "category": "Furniture",
    "name": "High Dot stool leather",
    "sku": "sku_559961",
    "price": 463,
    "image": "https://www.nordicnest.com/4b01ac/globalassets/product-pictures/fritz-hansen/37338-02-02.jpg?quality=80&format=webp&width=740",
    "description": "The High Dot stool leather from Fritz Hansen is a stable little seat made from premium leather and three legs of quality steel.",
    "description_long": "The High Dot stool leather from Fritz Hansen is a stable little seat made from premium leather and three legs of quality steel. The original Dot stool design was realized in 1954 by Arne Jacobsen and Fritz Hansen. This is an updated version of the classic, now with a sustainable twist: it utilizes the same high-quality leather as the design icons Ägget and Svanen for its luxurious and comfortable seat. Three braces on the bottom serve as convenient footrests while also providing additional stability. The High Dot stool is perfect for a high desk or kitchen island and makes for a striking interior detail in any design-conscious home.",
    "currency": "USD",
    "countInStock": 2 
  },
  {
    "id": "6Bh3pq",
    "category": "Cookware",
    "name": "Satake Kuro chopper",
    "sku": "sku_119140",
    "price": 150,
    "image": "https://www.nordicnest.com/4ae6b2/globalassets/product-pictures/satake/33932-01-02.jpg?quality=80&format=webp&width=740",
    "description": "The Satake Kuro Chopper is a handmade and rough forged knife of exceptional quality. It has been developed with a focus on sharpness, precision ",
    "description_long": "The Satake Kuro Chopper is a handmade and rough forged knife of exceptional quality. It has been developed with a focus on sharpness, precision and strength, as evidenced by the 5CR15MOV steel of the blade, which has been processed eight times over. The knife even has a hole to hang it up when not in use. The beautiful burnt wood handle provides excellent stability to an already elegant knife. All of the knives in Satake's Kuro series make perfect gifts for cooking enthusiasts who are looking for high quality knives with a little something special.",
    "currency": "USD",
    "countInStock": 7 
  }
]
